1. friend_list.csv 파일을 불러와서 상위5개만 출력해 보세요.

In [3]:
import pandas
df = pandas.read_csv('../data/friend_list.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

2. friend_list.txt 파일을 불러와서 상위 5개만 출력해 보세요.

In [5]:
import pandas
df = pandas.read_csv('../data/friend_list.txt')
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

3. friend_list_tab.txt 파일을 불러와서 상위 5개만 출력해 보세요.

In [6]:
import pandas
df = pandas.read_csv('../data/friend_list_tab.txt')
df.head()

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager

4. 헤더가 없는 friend_list_no_head.csv 파일의 첫번째 데이터가 헤더로 들어가지 않도록 불러와 보세요.

In [20]:
import pandas as pd
column_headers = ['name', 'age', 'job']
df = pd.read_csv('../data/friend_list_no_head.csv', names = column_headers)
print(df.head())

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

5. 아래와 같은 데이터프레임을 만들어 보세요.
	name	age	job
------------------------------------
0	John	20	student
1	Jenny	30	developer
2	Nate	30	teacher

In [31]:
df1 = pd.DataFrame({
    'Name': ['John', 'Jenny', 'Nate'],
     'age': [20, 30, 30],
     'job': ['student', 'developer', 'teacher']})
df1

    Name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

6. 1부터 3까지 행(row)을 출력해 보세요.(순차적 선택)

In [40]:
df1.iloc[1:4]

    Name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

7. 0, 2번 행(row)을 선택해서 출력해 보세요.(순차적이지 않은 row 선택)

In [37]:
df1.iloc[[0, 2]]

   Name  age      job
0  John   20  student
2  Nate   30  teacher

8. 모든 행(row)을 보여주되, 열(column)은 0부터 1까지만 출력

In [36]:
df1.iloc[:,[0,1]]

    Name  age
0   John   20
1  Jenny   30
2   Nate   30

9. 모든 행(row)을 보여주되, 열(column) 0와 2만 출력

In [34]:
df1.iloc[:,[0,2]]

    Name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

10. 데이터프레임에서 'name'과 'age' 열만 출력해 보세요.

In [44]:
df1.loc[:,['Name', 'age']]

    Name  age
0   John   20
1  Jenny   30
2   Nate   30